STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_usb_drd_core.h
/**
  ******************************************************************************
  * @file    stm32u5xx_usb_drd_core.h
  * @brief   Header file of USB DRD Core module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32U5xx_USB_DRD_CORE_H
#define STM32U5xx_USB_DRD_CORE_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/* Includes ------------------------------------------------------------------*/
#include "stm32u5xx.h"
#include "stm32u5xx_usb_core_def.h"

/** @addtogroup STM32U5xx_HAL_Driver
  * @{
  */
#if defined (USB_DRD_FS)
/** @defgroup USB_DRD_CORE USB DRD CORE
  * @{
  */

/* Private constants ---------------------------------------------------------*/
/** @defgroup USB_DRD_Private_Constants USB DRD Private Constants
  * @{
  */
/**
  * @brief  USB DRD Timeout
  */
#ifndef USB_DRD_TIMEOUT
#define USB_DRD_TIMEOUT                                              0xF000000U
#endif /* define USB_DRD_TIMEOUT */


/**
  * @brief  USB DRD PMA Lookup Table: size depending on PMA Size
  *         8Bytes each Block 32Bit in each word
  */
#define PMA_BLOCKS                            ((USB_DRD_PMA_SIZE) / (8U * 32U))


/**
  * @brief  USB DRD First available address in PMA
  */
#define PMA_START_ADDR            (0x10U + (8U * (USB_DRD_USED_CHANNELS - 2U)))


/**
  * @brief  USB DRD Last available address in PMA
  */
#define PMA_END_ADDR                                           USB_DRD_PMA_SIZE


/**
  * @brief USB DRD MAX channels/endpoints
  */
#define USB_DRD_MAX_CHEP_NBR                                                 8U

/**
  * @brief USB DRD GET CHEP DBUF0 CNT
  */
#define USB_DRD_GET_CHEP_DBUF0_CNT                        USB_DRD_GET_CHEP_TX_CNT

/**
  * @brief  Gets buffer 1 address of a double buffer endpoint
  */
#define USB_DRD_GET_CHEP_DBUF1_CNT                        USB_DRD_GET_CHEP_RX_CNT

/**
  * @brief  Gets TX Endpoint address
  */
#define USB_DRD_GET_EP_TX_CNT                             USB_DRD_GET_CHEP_TX_CNT

/**
  * @brief  Gets TX Channel address
  */
#define USB_DRD_GET_CH_TX_CNT                             USB_DRD_GET_CHEP_TX_CNT

/**
  * @brief  Gets RX Endpoint address
  */
#define USB_DRD_GET_EP_RX_CNT                             USB_DRD_GET_CHEP_RX_CNT

/**
  * @brief USB DRD GET CHANNEL RX CNT
  */
#define USB_DRD_GET_CH_RX_CNT                             USB_DRD_GET_CHEP_RX_CNT

/**
  * @brief USB DRD CNTRX_NBLK Mask
  */
#define USB_CNTRX_NBLK_MSK                                         (0x1FUL << 26)

/**
  * @brief USB DRD CNTRX_BLSIZE Mask
  */
#define USB_CNTRX_BLSIZE                                            (0x1UL << 31)

/**
  * @brief PMA RX counter
  */
#ifndef PCD_RX_PMA_CNT
#define PCD_RX_PMA_CNT                                               10U
#endif /* PCD_RX_PMA_CNT */

/**
  * @brief Set ENDPOINT Register value
  */
#define PCD_SET_ENDPOINT                       USB_DRD_SET_CHEP

/**
  * @brief Get ENDPOINT Register value
  */
#define PCD_GET_ENDPOINT                       USB_DRD_GET_CHEP

/**
  * @brief  sets the status for tx transfer (bits STAT_TX[1:0])
  */
#define PCD_SET_EP_TX_STATUS                   USB_DRD_SET_CHEP_TX_STATUS

/**
  * @brief  sets the status for rx transfer (bits STAT_TX[1:0])
  */
#define PCD_SET_EP_RX_STATUS                   USB_DRD_SET_CHEP_RX_STATUS

/**
  * @brief  Sets directly EP_KIND bit in the endpoint register
  */
#define PCD_SET_EP_KIND                        USB_DRD_SET_CHEP_KIND

/**
  * @brief  Clears directly EP_KIND bit in the endpoint register
  */
#define PCD_CLEAR_EP_KIND                      USB_DRD_CLEAR_CHEP_KIND

/**
  * @brief  Sets directly Bulk Endpoint_Double_Buffer bit in the endpoint register
  */
#define PCD_SET_BULK_EP_DBUF                   USB_DRD_SET_CHEP_KIND

/**
  * @brief  Clears directly Bulk Endpoint_Double_Buffer bit in the endpoint register
  */
#define PCD_CLEAR_BULK_EP_DBUF                 USB_DRD_CLEAR_CHEP_KIND

/**
  * @brief  Sets directly STATUS_OUT bit in the endpoint register
  */
#define PCD_SET_OUT_STATUS                     USB_DRD_SET_CHEP_KIND

/**
  * @brief  Clears directly STATUS_OUT bit in the endpoint register
  */
#define PCD_CLEAR_OUT_STATUS                   USB_DRD_CLEAR_CHEP_KIND

/**
  * @brief  Clears bit CTR_RX / CTR_TX in the endpoint register
  */
#define PCD_CLEAR_RX_EP_CTR                    USB_DRD_CLEAR_RX_CHEP_CTR

/**
  * @brief  Clears bit CTR_TX in the endpoint register
  */
#define PCD_CLEAR_TX_EP_CTR                    USB_DRD_CLEAR_TX_CHEP_CTR

/**
  * @brief  Toggles DTOG_RX bit in the endpoint register
  */
#define PCD_RX_DTOG                            USB_DRD_RX_DTOG

/**
  * @brief  Toggles DTOG_TX bit in the endpoint register
  */
#define PCD_TX_DTOG                            USB_DRD_TX_DTOG

/**
  * @brief  Clears DTOG_RX bit in the endpoint register
  */
#define PCD_CLEAR_RX_DTOG                      USB_DRD_CLEAR_RX_DTOG

/**
  * @brief  Clears DTOG_TX bit in the endpoint register
  */
#define PCD_CLEAR_TX_DTOG                      USB_DRD_CLEAR_TX_DTOG


/**
  * @brief  Sets address in an endpoint register
  */
#define PCD_SET_EP_ADDRESS                     USB_DRD_SET_CHEP_ADDRESS

/**
  * @brief  sets address of the tx buffer
  */
#define PCD_SET_EP_TX_ADDRESS                  USB_DRD_SET_CHEP_TX_ADDRESS


/**
  * @brief  sets address of the rx buffer
  */
#define PCD_SET_EP_RX_ADDRESS                  USB_DRD_SET_CHEP_RX_ADDRESS


/**
  * @brief  sets counter for the txbuffer
  */
#define PCD_SET_EP_TX_CNT                      USB_DRD_SET_CHEP_TX_CNT

/**
  * @brief  sets counter for the rx buffer
  */
#define PCD_SET_EP_RX_CNT                      USB_DRD_SET_CHEP_RX_CNT

/**
  * @brief  gets counter of the tx buffer
  */
#define PCD_GET_EP_TX_CNT                      USB_DRD_GET_CHEP_TX_CNT

/**
  * @brief  Sets addresses in a double buffer endpoint
  */
#define PCD_SET_EP_DBUF_ADDR                   USB_DRD_SET_CHEP_DBUF_ADDR

/**
  * @brief  Sets buffer 0 address of a double buffer endpoint
  */
#define PCD_SET_EP_DBUF0_CNT                   USB_DRD_SET_CHEP_DBUF0_CNT

/**
  * @brief  Sets buffer 1 address of a double buffer endpoint
  */
#define PCD_SET_EP_DBUF1_CNT                   USB_DRD_SET_CHEP_DBUF1_CNT

/**
  * @brief  Sets double buffer address of a double buffer endpoint
  */
#define PCD_SET_EP_DBUF_CNT                    USB_DRD_SET_CHEP_DBUF_CNT

/**
  * @brief  Powerdown exit count
  */
#define USB_DRD_PDWN_EXIT_CNT                  0x100U

/**
  * @brief  Set Channel
  */
#define HCD_SET_CHANNEL                        USB_DRD_SET_CHEP

/**
  * @brief  Get Channel Register
  */
#define HCD_GET_CHANNEL                        USB_DRD_GET_CHEP


/**
  * @brief Set the Setup bit in the corresponding channel, when a Setup
     transaction is needed
  */
#define HCD_SET_CH_TX_SETUP                    USB_DRD_CHEP_TX_SETUP


/**
  * @brief  sets the status for tx transfer (bits STAT_TX[1:0])
  */
#define HCD_SET_CH_TX_STATUS                   USB_DRD_SET_CHEP_TX_STATUS


/**
  * @brief  sets the status for rx transfer (bits STAT_TX[1:0])
  */
#define HCD_SET_CH_RX_STATUS                   USB_DRD_SET_CHEP_RX_STATUS

/**
  * @brief  gets the status for tx transfer (bits STAT_TX[1:0])
  */
#define HCD_GET_CH_TX_STATUS                   USB_DRD_GET_CHEP_TX_STATUS

/**
  * @brief  gets the status for rx transfer (bits STAT_RX[1:0])
  */
#define HCD_GET_CH_RX_STATUS                   USB_DRD_GET_CHEP_RX_STATUS

/**
  * @brief  Sets CH_KIND bit in the Channel register
  */
#define HCD_SET_CH_KIND                        USB_DRD_SET_CH_KIND

/**
  * @brief  Clears CH_KIND bit in the Channel register
  */
#define HCD_CLEAR_CH_KIND                      USB_DRD_CLEAR_CH_KIND

/**
  * @brief  Sets Bulk Channel bit in the Channel register
  */
#define HCD_SET_BULK_CH_DBUF                   HCD_SET_CH_KIND

/**
  * @brief  Clears Bulk Channel bit in the Channel register
  */
#define HCD_CLEAR_BULK_CH_DBUF                 HCD_CLEAR_CH_KIND


/**
  * @brief  Clears bit ERR_RX in the Channel register
  */
#define HCD_CLEAR_RX_CH_ERR                    USB_DRD_CLEAR_CHEP_RX_ERR

/**
  * @brief  Clears bit ERR_TX in the Channel register
  */
#define HCD_CLEAR_TX_CH_ERR                    USB_DRD_CLEAR_CHEP_TX_ERR

/**
  * @brief  Clears bit CTR_RX in the endpoint register
  */
#define HCD_CLEAR_RX_CH_CTR                    USB_DRD_CLEAR_RX_CHEP_CTR

/**
  * @brief  Clears bit CTR_TX in the endpoint register
  */
#define HCD_CLEAR_TX_CH_CTR                    USB_DRD_CLEAR_TX_CHEP_CTR

/**
  * @brief  Toggles DTOG_RX bit in the endpoint register
  */
#define HCD_RX_DTOG                            USB_DRD_RX_DTOG

/**
  * @brief  Toggles DTOG_TX bit in the endpoint register
  */
#define HCD_TX_DTOG                            USB_DRD_TX_DTOG

/**
  * @brief  Clears DTOG_RX bit in the endpoint register
  */
#define HCD_CLEAR_RX_DTOG                      USB_DRD_CLEAR_RX_DTOG

/**
  * @brief  Clears DTOG_TX bit in the endpoint register
  */
#define HCD_CLEAR_TX_DTOG                      USB_DRD_CLEAR_TX_DTOG


/**
  * @brief  sets counter for the tx buffer
  */
#define HCD_SET_CH_TX_CNT                      USB_DRD_SET_CHEP_TX_CNT

/**
  * @brief  sets counter for the rx buffer
  */
#define HCD_SET_CH_RX_CNT                      USB_DRD_SET_CHEP_RX_CNT


/**
  * @brief  gets counter of the tx buffer
  */
#define HCD_GET_CH_TX_CNT                      USB_DRD_GET_CHEP_TX_CNT

/**
  * @brief  Sets buffer 0 address of a double buffer endpoint
  */
#define HCD_SET_CH_DBUF0_CNT                   USB_DRD_SET_CHEP_DBUF0_CNT

/**
  * @brief  Sets buffer 1 address of a double buffer endpoint
  */
#define HCD_SET_CH_DBUF1_CNT                   USB_DRD_SET_CHEP_DBUF1_CNT

/**
  * @brief  Sets double buffer address of a double buffer endpoint
  */
#define HCD_SET_CH_DBUF_CNT                    USB_DRD_SET_CHEP_DBUF_CNT

/**
  * @brief  USB DRD core typedef definition
  */
typedef USB_DRD_TypeDef usb_drd_global_t;


/**
  * @brief  USB Endpoint Configuration Structure definition
  */
typedef struct
{
  usb_core_channel_t virtual_ch_num;  /*!< Virtual Channel number associated to the Endpoint number
                                           This parameter must be a number between Min_Data = 1 and Max_Data = 15 */

  usb_core_ep_direction_t dir;        /*!< Endpoint direction state
                                           This parameter must be a number between Min_Data = 0 and Max_Data = 1  */

