STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_usb_drd_core.h
  uint8_t is_allocated;               /*!< Endpoint allocation state
                                           This parameter must be a number between Min_Data = 0 and Max_Data = 1  */

  uint8_t is_dual_allocated;          /*!< Endpoint dual allocation state
                                           This parameter must be a number between Min_Data = 0 and Max_Data = 1  */

  uint16_t pma_address;               /*!< PMA Address
                                           This parameter can be any value between Min_addr = 0 and Max_addr = 1K */

  uint16_t pma_addr0;                 /*!< PMA Address0
                                           This parameter can be any value between Min_addr = 0 and Max_addr = 1K */

  uint16_t pma_addr1;                 /*!< PMA Address1
                                           This parameter can be any value between Min_addr = 0 and Max_addr = 1K */

} usb_drd_ep_config_t;


/**
  * @brief  USB DRD DoubleBuffer structure definition
  */
typedef enum
{
  USB_DRD_SNG_BUF = USB_CORE_CONFIG_DISABLED,   /*!< USB DOUBLE Buffer state disabled: 0 */
  USB_DRD_DBL_BUF = USB_CORE_CONFIG_ENABLED,    /*!< USB DOUBLE Buffer state enabled:  1 */
} usb_drd_doublebuffer_t;


/**
  * @brief  USB Endpoint double buffer Configuration Structure definition
  */
typedef struct
{
  usb_drd_doublebuffer_t is_bulk_db;      /*!< bulk Endpoint double buffer state
                                               This parameter must be a number between Min_Data = 0 and Max_Data = 1  */

  usb_drd_doublebuffer_t is_iso_db;       /*!< isochrone Endpoint double buffer state
                                               This parameter must be a number between Min_Data = 0 and Max_Data = 1  */
} usb_drd_ep_db_config_t;


/**
  * @brief  USB DRD DoubleBuffer API structure definition
  */
typedef enum
{
  USB_DRD_BULK_DB_ENBALE  = 0x01U,    /*!< USB DRD BULK Double Buffer Enable*/
  USB_DRD_BULK_DB_DISABLE = 0x02U,    /*!< USB DRD BULK Double Buffer Disable*/
  USB_DRD_ISOC_DB_ENBALE  = 0x03U,    /*!< USB DRD Isochnronous Double Buffer Enable*/
  USB_DRD_ISOC_DB_DISABLE = 0x04U,    /*!< USB DRD Isochnronous Double Buffer Disable*/
} usb_drd_db_status_t;

/**
  * @}
  */


/* Exported macro ------------------------------------------------------------*/

/** @defgroup DRD_Exported_Macros DRD Exported Macros
  *  @brief macros to handle interrupts and specific clock configurations
  * @{
  */

/**
  *  @brief macros to get Instance
  */
#define USB_DRD_GET_INSTANCE(instance)         ((usb_drd_global_t *)((uint32_t)instance))

/**
  *  @brief macros to get Channel Number
  */
#define USB_DRD_GET_CHNUM(instance)          (((instance)->ISTR) & USB_ISTR_IDN)

/**
  *  @brief macros to get Channel Direction
  */
#define USB_DRD_GET_CHDIR(instance)          (((instance)->ISTR) & USB_ISTR_DIR)


/**
  * @brief  Set Channel/Endpoint to the USB Register
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint Number
  * @param  reg_value Register Value
  */
__STATIC_INLINE void USB_DRD_SET_CHEP(uint32_t instance, usb_core_phy_chep_t ch_ep_num, uint32_t reg_value)
{
  usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);

  *(__IO uint32_t *)(&p_usb->CHEP0R + (uint32_t)ch_ep_num) = reg_value;

  return;
}

/**
  * @brief  Get Channel/Endpoint from the USB Register
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint Number
  * @retval Channel/endpoint number
  */
__STATIC_INLINE uint32_t USB_DRD_GET_CHEP(uint32_t instance, usb_core_phy_chep_t ch_ep_num)
{
  const usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);

  return (*(__IO const uint32_t *)(&p_usb->CHEP0R + (uint32_t)ch_ep_num));
}

/**
  * @brief  Toggles DTOG_RX bit in the endpoint register
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint Number
  */
__STATIC_INLINE void USB_DRD_RX_DTOG(uint32_t instance, usb_core_phy_chep_t ch_ep_num)
{
  uint32_t reg_value;

  reg_value = USB_DRD_GET_CHEP(instance, ch_ep_num) & USB_CHEP_REG_MASK;
  USB_DRD_SET_CHEP(instance, ch_ep_num, reg_value | USB_CHEP_VTRX | USB_CHEP_VTTX | USB_CHEP_DTOG_RX);

  return;
}

/**
  * @brief  Toggles DTOG_TX bit in the endpoint register
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint Number
  */
__STATIC_INLINE void USB_DRD_TX_DTOG(uint32_t instance, usb_core_phy_chep_t ch_ep_num)
{
  uint32_t reg_value;

  reg_value = USB_DRD_GET_CHEP(instance, ch_ep_num) & USB_CHEP_REG_MASK;
  USB_DRD_SET_CHEP(instance, ch_ep_num, reg_value | USB_CHEP_VTRX | USB_CHEP_VTTX | USB_CHEP_DTOG_TX);

  return;
}

/**
  * @brief Set the Setup bit in the corresponding channel, when a Setup
     transaction is needed
  * @param instance USB device
  * @param  ch_ep_num Channel/Endpoint Number
  */
__STATIC_INLINE void USB_DRD_CHEP_TX_SETUP(uint32_t instance, usb_core_phy_chep_t ch_ep_num)
{
  uint32_t reg_value;

  reg_value = USB_DRD_GET_CHEP(instance, ch_ep_num);

  /* Set Setup bit */
  USB_DRD_SET_CHEP(instance, ch_ep_num, reg_value | USB_CHEP_SETUP);

  return;
}

/**
  * @brief  Clears bit ERR_RX in the Channel register
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Channel/Endpoint Number
  */
__STATIC_INLINE void USB_DRD_CLEAR_CHEP_RX_ERR(uint32_t instance, usb_core_phy_chep_t ch_ep_num)
{
  uint32_t reg_value;

  reg_value = USB_DRD_GET_CHEP(instance, ch_ep_num);
  reg_value = (reg_value & USB_CHEP_REG_MASK & (~USB_CHEP_ERRRX) & (~USB_CHEP_VTRX)) | (USB_CHEP_VTTX | USB_CHEP_ERRTX);
  USB_DRD_SET_CHEP(instance, ch_ep_num, reg_value);

  return;
}

/**
  * @brief  Clears bit ERR_TX in the Channel register
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Channel/Endpoint Number
  */
__STATIC_INLINE void USB_DRD_CLEAR_CHEP_TX_ERR(uint32_t instance, usb_core_phy_chep_t ch_ep_num)
{
  uint32_t reg_value;

  reg_value = USB_DRD_GET_CHEP(instance, ch_ep_num);
  reg_value = (reg_value & USB_CHEP_REG_MASK & (~USB_CHEP_ERRTX) & (~USB_CHEP_VTTX)) | (USB_CHEP_VTRX | USB_CHEP_ERRRX);
  USB_DRD_SET_CHEP(instance, ch_ep_num, reg_value);

  return;
}

/**
  * @brief  sets the status for tx transfer (bits STAT_TX[1:0])
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint Number
  * @param  ep_ch_state new state
  */
__STATIC_INLINE void USB_DRD_SET_CHEP_TX_STATUS(uint32_t instance, usb_core_phy_chep_t ch_ep_num, uint32_t ep_ch_state)
{
  uint32_t reg_value;

  reg_value = USB_DRD_GET_CHEP(instance, ch_ep_num) & USB_CHEP_TX_DTOGMASK;

  /* toggle first bit ? */
  if ((USB_CHEP_TX_DTOG1 & ep_ch_state) != 0U)
  {
    reg_value ^= USB_CHEP_TX_DTOG1;
  }

  /* toggle second bit ? */
  if ((USB_CHEP_TX_DTOG2 & ep_ch_state) != 0U)
  {
    reg_value ^= USB_CHEP_TX_DTOG2;
  }

