STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_usb_drd_core.h
  USB_DRD_SET_CHEP(instance, ch_ep_num, (reg_value | USB_CHEP_VTRX | USB_CHEP_VTTX));

  return;
}

/**
  * @brief  sets the status for rx transfer (bits STAT_TX[1:0])
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint Number
  * @param  ep_ch_state new state
  */
__STATIC_INLINE void USB_DRD_SET_CHEP_RX_STATUS(uint32_t instance, usb_core_phy_chep_t ch_ep_num, uint32_t ep_ch_state)
{
  uint32_t reg_value;

  reg_value = USB_DRD_GET_CHEP(instance, ch_ep_num) & USB_CHEP_RX_DTOGMASK;

  /* toggle first bit ? */
  if ((USB_CHEP_RX_DTOG1 & ep_ch_state) != 0U)
  {
    reg_value ^= USB_CHEP_RX_DTOG1;
  }
  else
  {
    /* nothing to do */
  }

  /* toggle second bit ? */
  if ((USB_CHEP_RX_DTOG2 & ep_ch_state) != 0U)
  {
    reg_value ^= USB_CHEP_RX_DTOG2;
  }
  else
  {
    /* nothing to do */
  }

  USB_DRD_SET_CHEP(instance, ch_ep_num, (reg_value | USB_CHEP_VTRX | USB_CHEP_VTTX));

  return;
}

/**
  * @brief  gets the status for tx transfer (bits STAT_TX[1:0]
  *         /STAT_RX[1:0])
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint Number
  * @retval status for tx transfer
  */
__STATIC_INLINE uint16_t USB_DRD_GET_CHEP_TX_STATUS(uint32_t instance, usb_core_phy_chep_t ch_ep_num)
{
  return (uint16_t)(USB_DRD_GET_CHEP(instance, ch_ep_num) & USB_CHEP_TX_STTX);
}

/**
  * @brief  gets the status for rx transfer (bits STAT_TX[1:0]
  *         /STAT_RX[1:0])
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint Number
  * @retval  ch_ep_num RX status
  */
__STATIC_INLINE uint16_t USB_DRD_GET_CHEP_RX_STATUS(uint32_t instance, usb_core_phy_chep_t ch_ep_num)
{
  return (uint16_t)(USB_DRD_GET_CHEP(instance, ch_ep_num) & USB_CHEP_RX_STRX);
}

/**
  * @brief  set  EP_KIND bit
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint Number
  */
__STATIC_INLINE void USB_DRD_SET_CHEP_KIND(uint32_t instance, usb_core_phy_chep_t ch_ep_num)
{
  uint32_t reg_value;

  reg_value = USB_DRD_GET_CHEP(instance, ch_ep_num) & USB_CHEP_REG_MASK;
  USB_DRD_SET_CHEP(instance, ch_ep_num, (reg_value | USB_CHEP_VTRX | USB_CHEP_VTTX | USB_CHEP_KIND));

  return;
}

/**
  * @brief  clear EP_KIND bit
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint Number
  */
__STATIC_INLINE void USB_DRD_CLEAR_CHEP_KIND(uint32_t instance, usb_core_phy_chep_t ch_ep_num)
{
  uint32_t reg_value;

  reg_value = USB_DRD_GET_CHEP(instance, ch_ep_num) & USB_EP_KIND_MASK;
  USB_DRD_SET_CHEP(instance, ch_ep_num, (reg_value | USB_CHEP_VTRX | USB_CHEP_VTTX));

  return;
}

/**
  * @brief  Clears bit CTR_RX in the endpoint register
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint Number
  */
__STATIC_INLINE void USB_DRD_CLEAR_RX_CHEP_CTR(uint32_t instance, usb_core_phy_chep_t ch_ep_num)
{
  uint32_t reg_value;

  reg_value = USB_DRD_GET_CHEP(instance, ch_ep_num) & (0xFFFF7FFFU & USB_CHEP_REG_MASK);
  USB_DRD_SET_CHEP(instance, ch_ep_num, (reg_value | USB_CHEP_VTTX));

  return;
}

/**
  * @brief  Clears bit CTR_TX in the endpoint register
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint Number
  */
__STATIC_INLINE void USB_DRD_CLEAR_TX_CHEP_CTR(uint32_t instance, usb_core_phy_chep_t ch_ep_num)
{
  uint32_t reg_value;

  reg_value = USB_DRD_GET_CHEP(instance, ch_ep_num) & (0xFFFFFF7FU & USB_CHEP_REG_MASK);
  USB_DRD_SET_CHEP(instance, ch_ep_num, (reg_value | USB_CHEP_VTRX));

  return;
}

/**
  * @brief  Clears DTOG_RX bit in the endpoint register
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint Number
  */
__STATIC_INLINE void USB_DRD_CLEAR_RX_DTOG(uint32_t instance, usb_core_phy_chep_t ch_ep_num)
{
  uint32_t reg_value;

  reg_value = USB_DRD_GET_CHEP(instance, ch_ep_num);
  if ((reg_value & USB_CHEP_DTOG_RX) != 0U)
  {
    USB_DRD_RX_DTOG(instance, ch_ep_num);
  }
  else
  {
    /* nothing to do */
  }

  return;
}

/**
  * @brief  Clears DTOG_TX bit in the endpoint register
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint Number
  */
__STATIC_INLINE void USB_DRD_CLEAR_TX_DTOG(uint32_t instance, usb_core_phy_chep_t ch_ep_num)
{
  uint32_t reg_value;

  reg_value = USB_DRD_GET_CHEP(instance, ch_ep_num);
  if ((reg_value & USB_CHEP_DTOG_TX) != 0U)
  {
    USB_DRD_TX_DTOG(instance, ch_ep_num);
  }
  else
  {
    /* nothing to do */
  }

  return;
}

/**
  * @brief  Sets address in an endpoint register
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint Number
  * @param  address Address
  */
__STATIC_INLINE void USB_DRD_SET_CHEP_ADDRESS(uint32_t instance, usb_core_phy_chep_t ch_ep_num, uint32_t address)
{
  uint32_t reg_value;

  /* Read the USB->CHEPx into reg_value, Reset(DTOGRX/STRX/DTOGTX/STTX) and set the Ep Address */
  reg_value = (USB_DRD_GET_CHEP(instance, ch_ep_num) & USB_CHEP_REG_MASK) | address;

  /* Set reg_value in USB->CHEPx and set Transmit/Receive Valid Transfer  (x=ch_ep_num) */
  USB_DRD_SET_CHEP(instance, ch_ep_num, (reg_value | USB_CHEP_VTRX | USB_CHEP_VTTX));

  return;
}

/* PMA API Buffer Descriptor Management ------------------------------------------------------------*/

/**
  * @brief  Set TX Buffer Descriptor Address Field
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint Number
  * @param  address TX address
  */
__STATIC_INLINE void USB_DRD_SET_CHEP_TX_ADDRESS(uint32_t instance, usb_core_phy_chep_t ch_ep_num, uint32_t address)
{
  STM32_UNUSED(instance);

  /* Reset old Address */
  (USB_DRD_PMA_BUFF + (uint32_t)ch_ep_num)->TXBD &= USB_PMA_TXBD_ADDMSK;

  /* Bit0 & Bit1 = 0 PMA must be Word aligned */
  (USB_DRD_PMA_BUFF + (uint32_t)ch_ep_num)->TXBD |= (uint32_t)(((uint32_t)address >> 2U) << 2U);

  return;
}

/**
  * @brief  Set RX Buffer Descriptor Address Field
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint Number
  * @param  address RX address
  */
__STATIC_INLINE void USB_DRD_SET_CHEP_RX_ADDRESS(uint32_t instance, usb_core_phy_chep_t ch_ep_num, uint32_t address)
{
  STM32_UNUSED(instance);

