STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_usb_drd_core.h
  /* Reset old Address */
  (USB_DRD_PMA_BUFF + (uint32_t)ch_ep_num)->RXBD &= USB_PMA_RXBD_ADDMSK;

  /* Bit0 & Bit1 = 0 PMA must be Word aligned */
  (USB_DRD_PMA_BUFF + (uint32_t)ch_ep_num)->RXBD |= (uint32_t)(((uint32_t)address >> 2U) << 2U);

  return;
}

/**
  * @brief  Sets counter of rx buffer with no of blocks
  * @param  rx_count Register pointer
  * @param  count Counter
  */
__STATIC_INLINE void USB_DRD_SET_CHEP_CNT_RX_REG(volatile uint32_t *rx_count, uint32_t count)
{
  uint32_t nbr_blocks;

  *rx_count &= ~(USB_CNTRX_BLSIZE | USB_CNTRX_NBLK_MSK);

  if (count == 0U)
  {
    *rx_count |= USB_CNTRX_BLSIZE;
  }
  else if ((count) <= 62U)
  {
    /* Divide PacketSize by 32 to calculate the Nb of Block32 */
    nbr_blocks = (uint32_t)((uint32_t)count >> 1U);

    if ((count & 0x1U) != 0U)
    {
      nbr_blocks++;
    }

    *rx_count |= (uint32_t)(nbr_blocks << 26U);
  }
  else
  {
    /* Divide PacketSize by 32 to calculate the Nb of Block32 */
    nbr_blocks = ((uint32_t)count >> 5U);

    if (((uint32_t)(count) % 32U) == 0U)
    {
      nbr_blocks--;
    }

    *rx_count |= (uint32_t)(((nbr_blocks << 26U)) | USB_CNTRX_BLSIZE);
  }

  return;
}

/**
  * @brief  sets counter for the tx buffer
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint Number
  * @param  count Counter value
  */
__STATIC_INLINE void USB_DRD_SET_CHEP_TX_CNT(uint32_t instance, usb_core_phy_chep_t ch_ep_num, uint32_t count)
{
  STM32_UNUSED(instance);

  /* Reset old TX_Count value */
  (USB_DRD_PMA_BUFF + (uint32_t)ch_ep_num)->TXBD &= USB_PMA_TXBD_COUNTMSK;

  /* Set the count in the dedicated EP_TXBuffer */
  (USB_DRD_PMA_BUFF + (uint32_t)ch_ep_num)->TXBD |= (uint32_t)((uint32_t)count << 16U);

  return;
}

/**
  * @brief  sets counter for the rx double buffer0
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint Number
  * @param  count Counter value
  */
__STATIC_INLINE void USB_DRD_SET_CHEP_RX_DBUF0_CNT(uint32_t instance, usb_core_phy_chep_t ch_ep_num, uint32_t count)
{
  STM32_UNUSED(instance);

  /* Set the count in the dedicated EP_TXBuffer */
  USB_DRD_SET_CHEP_CNT_RX_REG((volatile uint32_t *) & (USB_DRD_PMA_BUFF + (uint32_t)ch_ep_num)->TXBD, count);

  return;
}

/**
  * @brief  sets counter for the rx buffer
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint Number
  * @param  count Counter value
  */
__STATIC_INLINE void USB_DRD_SET_CHEP_RX_CNT(uint32_t instance, usb_core_phy_chep_t ch_ep_num, uint32_t count)
{
  STM32_UNUSED(instance);

  /* Set the count in the dedicated EP_RXBuffer */
  USB_DRD_SET_CHEP_CNT_RX_REG((volatile uint32_t *) & (USB_DRD_PMA_BUFF + (uint32_t)ch_ep_num)->RXBD, count);

  return;
}

/**
  * @brief  gets counter of the tx buffer
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint Number
  * @retval Counter value
  */
__STATIC_INLINE uint16_t USB_DRD_GET_CHEP_TX_CNT(uint32_t instance, usb_core_phy_chep_t ch_ep_num)
{
  STM32_UNUSED(instance);
  return (uint16_t)(((USB_DRD_PMA_BUFF + (uint32_t)ch_ep_num)->TXBD & 0x03FF0000U) >> 16U);
}

/**
  * @brief  gets counter of the rx buffer
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint Number
  * @retval Counter value
  */
__STATIC_INLINE uint16_t USB_DRD_GET_CHEP_RX_CNT(uint32_t instance, usb_core_phy_chep_t ch_ep_num)
{
  STM32_UNUSED(instance);
  return (uint16_t)(((USB_DRD_PMA_BUFF + (uint32_t)ch_ep_num)->RXBD & 0x03FF0000U) >> 16U);
}

/**
  * @brief  Sets buffer 0 address in a double buffer endpoint
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint Number
  * @param  buff0_addr buffer 0 address
  */
__STATIC_INLINE void USB_DRD_SET_CHEP_DBUF0_ADDR(uint32_t instance, usb_core_phy_chep_t ch_ep_num, uint32_t buff0_addr)
{
  USB_DRD_SET_CHEP_TX_ADDRESS(instance, ch_ep_num, buff0_addr);

  return;
}

/**
  * @brief  Sets buffer 1 address in a double buffer endpoint
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint Number
  * @param  buff1_addr buffer 1 address
  */
__STATIC_INLINE void USB_DRD_SET_CHEP_DBUF1_ADDR(uint32_t instance, usb_core_phy_chep_t ch_ep_num, uint32_t buff1_addr)
{
  USB_DRD_SET_CHEP_RX_ADDRESS(instance, ch_ep_num, buff1_addr);

  return;
}

/**
  * @brief  Sets addresses in a double buffer endpoint
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint Number
  * @param  buff0_addr: buffer 0 address
  * @param  buff1_addr = buffer 1 address
  */
__STATIC_INLINE void USB_DRD_SET_CHEP_DBUF_ADDR(uint32_t instance, usb_core_phy_chep_t ch_ep_num,
                                                uint32_t buff0_addr, uint32_t buff1_addr)
{
  USB_DRD_SET_CHEP_DBUF0_ADDR(instance, ch_ep_num, buff0_addr);
  USB_DRD_SET_CHEP_DBUF1_ADDR(instance, ch_ep_num, buff1_addr);

  return;
}

/**
  * @brief  Gets buffer 0 address of a double buffer endpoint
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint Number
  * @param  direction endpoint direction
  *         USB_CORE_EP_OUT_DIR = OUT
  *         USB_CORE_EP_IN_DIR  = IN
  * @param  count: Counter value
  */
__STATIC_INLINE void USB_DRD_SET_CHEP_DBUF0_CNT(uint32_t instance, usb_core_phy_chep_t ch_ep_num,
                                                usb_core_ep_direction_t direction, uint32_t count)
{
  if (direction == USB_CORE_EP_OUT_DIR)
  {
    /* OUT endpoint */
    USB_DRD_SET_CHEP_RX_DBUF0_CNT(instance, ch_ep_num, count);
  }
  else
  {
    /* IN endpoint */
    USB_DRD_SET_CHEP_TX_CNT(instance, ch_ep_num, count);
  }

  return;
}

/**
  * @brief  Gets buffer 1 address of a double buffer endpoint
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint Number
  * @param  direction endpoint direction
  *         USB_CORE_EP_OUT_DIR = OUT
  *         USB_CORE_EP_IN_DIR  = IN
  * @param  count: Counter value
  */
__STATIC_INLINE void USB_DRD_SET_CHEP_DBUF1_CNT(uint32_t instance, usb_core_phy_chep_t ch_ep_num,
                                                usb_core_ep_direction_t direction, uint32_t count)
{
  if (direction == USB_CORE_EP_OUT_DIR)
  {
    /* OUT endpoint */
    USB_DRD_SET_CHEP_RX_CNT(instance, ch_ep_num, count);
  }
  else
  {
    if (direction == USB_CORE_EP_IN_DIR)
    {
      /* IN endpoint */
      (USB_DRD_PMA_BUFF + (uint32_t)ch_ep_num)->RXBD &= USB_PMA_TXBD_COUNTMSK;
      (USB_DRD_PMA_BUFF + (uint32_t)ch_ep_num)->RXBD |= (uint32_t)((uint32_t)count << 16U);
    }
  }

  return;
}

/**
  * @brief  Sets buffer address of a double buffer endpoint
  * @param  instance USB peripheral instance register address
  * @param  ch_ep_num Endpoint Number
  * @param  direction endpoint direction
  *         USB_CORE_EP_OUT_DIR = OUT
  *         USB_CORE_EP_IN_DIR  = IN
  * @param  count: Counter value
  */
__STATIC_INLINE void USB_DRD_SET_CHEP_DBUF_CNT(uint32_t instance, usb_core_phy_chep_t ch_ep_num,
                                               usb_core_ep_direction_t direction, uint32_t count)
{
  USB_DRD_SET_CHEP_DBUF0_CNT(instance, ch_ep_num, direction, count);
  USB_DRD_SET_CHEP_DBUF1_CNT(instance, ch_ep_num, direction, count);

  return;
}

/**
  * @}
  */


/**
  * @brief  gets counter of the rx buffer
  * @param  instance USB peripheral instance register address
  * @param  ep_num Endpoint Number
  * @retval Counter value
  */
__STATIC_INLINE uint16_t PCD_GET_EP_RX_CNT(uint32_t instance, usb_core_phy_chep_t ep_num)
{
  STM32_UNUSED(instance);
  __IO uint32_t count = PCD_RX_PMA_CNT;

  /* WA: few cycles for RX PMA descriptor to update */
  while (count > 0U)
  {
    count--;
  }

  return (uint16_t)USB_DRD_GET_CHEP_RX_CNT(instance, ep_num);
}


/**
  * @brief  gets counter of the rx buffer0
  * @param  instance USB peripheral instance register address
  * @param  ep_num Endpoint Number
  * @retval Counter value
  */
__STATIC_INLINE uint16_t PCD_GET_EP_DBUF0_CNT(uint32_t instance, usb_core_phy_chep_t ep_num)
{
  STM32_UNUSED(instance);
  __IO uint32_t count = PCD_RX_PMA_CNT;

  /* WA: few cycles for RX PMA descriptor to update */
  while (count > 0U)
  {
    count--;
  }

  return (uint16_t)USB_DRD_GET_CHEP_DBUF0_CNT(instance, ep_num);
}


/**
  * @brief  gets counter of the rx buffer1
  * @param  instance USB peripheral instance register address
  * @param  ep_num Endpoint Number
  * @retval Counter value
  */
__STATIC_INLINE uint16_t PCD_GET_EP_DBUF1_CNT(uint32_t instance, usb_core_phy_chep_t ep_num)
{
  STM32_UNUSED(instance);
  __IO uint32_t count = PCD_RX_PMA_CNT;

  /* WA: few cycles for RX PMA descriptor to update */
  while (count > 0U)
  {
    count--;
  }

