STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_usb_drd_core.h
  return (uint16_t)USB_DRD_GET_CHEP_DBUF1_CNT(instance, ep_num);
}


/**
  * @brief  gets counter of the rx buffer
  * @param  instance USB peripheral instance register address
  * @param  phy_ch_num physical channel Number
  * @retval Counter value
  */
__STATIC_INLINE uint16_t HCD_GET_CH_RX_CNT(uint32_t instance, usb_core_phy_chep_t phy_ch_num)
{
  const usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);
  uint32_t ep_reg = USB_DRD_GET_CHEP(instance, phy_ch_num);
  __IO uint32_t count = 10U;

  /* Count depends on device LS */
  if (((p_usb->ISTR & USB_ISTR_LS_DCONN) == USB_ISTR_LS_DCONN) || ((ep_reg & USB_CHEP_LSEP) == USB_CHEP_LSEP))
  {
    count = (70U * (SystemCoreClock / 1000000U)) / 100U;
  }

  if (count > 15U)
  {
    count = USB_CORE_MAX(10U, (count - 15U));
  }

  /* WA: few cycles for RX PMA descriptor to update */
  while (count > 0U)
  {
    count--;
  }

  return (uint16_t)USB_DRD_GET_CHEP_RX_CNT(instance, phy_ch_num);
}

/**
  * @brief  gets counter of the rx buffer0.
  * @param  instance USB peripheral instance register address.
  * @param  phy_ch_num physical channel Number.
  * @retval Counter value
  */
__STATIC_INLINE uint16_t HCD_GET_CH_DBUF0_CNT(uint32_t instance, usb_core_phy_chep_t phy_ch_num)
{
  STM32_UNUSED(instance);
  __IO uint32_t count = 10U;

  /* WA: few cycles for RX PMA descriptor to update */
  while (count > 0U)
  {
    count--;
  }

  return (uint16_t)USB_DRD_GET_CHEP_DBUF0_CNT(instance, phy_ch_num);
}


/**
  * @brief  gets counter of the rx buffer1.
  * @param  instance USB peripheral instance register address.
  * @param  phy_ch_num physical channel Number.
  * @retval Counter value
  */
__STATIC_INLINE uint16_t HCD_GET_CH_DBUF1_CNT(uint32_t instance, usb_core_phy_chep_t phy_ch_num)
{
  STM32_UNUSED(instance);
  __IO uint32_t count = 10U;

  /* WA: few cycles for RX PMA descriptor to update */
  while (count > 0U)
  {
    count--;
  }

  return (uint16_t)USB_DRD_GET_CHEP_DBUF1_CNT(instance, phy_ch_num);
}

/* Exported functions --------------------------------------------------------*/
/** @defgroup USB_CORE_Exported_Functions USB Core Low Layer Exported Functions
  * @{
  */
usb_core_status_t USB_DRD_InitCore(uint32_t instance, const usb_core_config_params_t *p_core_config);
usb_core_status_t USB_DRD_DeInitCore(uint32_t instance);
usb_core_status_t USB_DRD_EnableGlobalInterrupt(uint32_t instance);
usb_core_status_t USB_DRD_DisableGlobalInterrupt(uint32_t instance);
usb_core_status_t USB_DRD_SetCurrentMode(uint32_t instance, usb_core_mode_t core_mode);
usb_core_mode_t USB_DRD_GetCurrentMode(uint32_t instance);

usb_core_status_t USB_DRD_ActivateRemoteWakeup(uint32_t instance);
usb_core_status_t USB_DRD_DeActivateRemoteWakeup(uint32_t instance);

uint32_t USB_DRD_ReadInterrupts(uint32_t instance);
void     USB_DRD_ClearInterrupts(uint32_t instance, uint32_t interrupt);
void     USB_DRD_WritePMA(uint32_t instance, uint8_t *p_src, uint16_t pma_address, uint16_t size_byte);
void     USB_DRD_ReadPMA(uint32_t instance, uint8_t *p_dest, uint16_t pma_address, uint16_t size_byte);

usb_core_status_t USB_DRD_PCD_InitDriver(usb_core_pcd_driver_t *p_driver);
usb_core_status_t USB_DRD_InitDevice(uint32_t instance, const usb_core_config_params_t *p_core_config);
usb_core_status_t USB_DRD_StartDevice(uint32_t instance);
usb_core_status_t USB_DRD_StopDevice(uint32_t instance);
usb_core_status_t USB_DRD_ActivateEndpoint(uint32_t instance, usb_core_ep_t *p_ep);
usb_core_status_t USB_DRD_DeactivateEndpoint(uint32_t instance, const usb_core_ep_t *p_ep);
usb_core_status_t USB_DRD_StartEndpointXfer(uint32_t instance, usb_core_ep_t *p_ep);
usb_core_status_t USB_DRD_StopEndpointXfer(uint32_t instance, const usb_core_ep_t *p_ep);
usb_core_status_t USB_DRD_SetEndpointStall(uint32_t instance, const usb_core_ep_t *p_ep);
usb_core_status_t USB_DRD_ClearEndpointStall(uint32_t instance, const usb_core_ep_t *p_ep);
usb_core_status_t USB_DRD_SetDeviceAddress(uint32_t instance, uint8_t address);
usb_core_status_t USB_DRD_ConnectDevice(uint32_t instance);
usb_core_status_t USB_DRD_DisconnectDevice(uint32_t instance);
usb_core_device_speed_t USB_DRD_GetDeviceSpeed(uint32_t instance);

usb_core_status_t  USB_DRD_BCD_SetMode(uint32_t instance,
                                       usb_core_bcd_config_t bcd_config, usb_core_bcd_config_sts_t bcd_sts);
usb_core_bcd_port_status_t USB_DRD_BCD_SetPortDetection(uint32_t instance, usb_core_bcd_detection_t detection);
usb_core_status_t USB_DRD_BCD_Activate(uint32_t instance);
usb_core_status_t USB_DRD_BCD_DeActivate(uint32_t instance);

usb_core_status_t USB_DRD_LPM_Activate(uint32_t instance);
usb_core_status_t USB_DRD_LPM_DeActivate(uint32_t instance);

usb_core_status_t USB_DRD_HCD_InitDriver(usb_core_hcd_driver_t *p_driver);
usb_core_status_t USB_DRD_PortReset(uint32_t instance, usb_core_port_reset_sts_t reset_status);
usb_core_status_t USB_DRD_PortSuspend(uint32_t instance);
usb_core_status_t USB_DRD_PortResume(uint32_t instance, usb_core_port_resume_sts_t resume_status);
usb_core_status_t USB_DRD_InitHost(uint32_t instance, const usb_core_config_params_t *p_core_config);
usb_core_status_t USB_DRD_StartHost(uint32_t instance);
usb_core_status_t USB_DRD_StopHost(uint32_t instance);
usb_core_status_t USB_DRD_SetChannelDoubleBuffer(uint32_t instance, usb_core_phy_chep_t phy_ch_num,
                                                 usb_drd_db_status_t db_status);

usb_core_status_t USB_DRD_InitChannel(uint32_t instance, usb_core_ch_t *p_ch);
usb_core_status_t USB_DRD_CloseChannel(uint32_t instance, usb_core_ch_t *p_ch);
usb_core_status_t USB_DRD_HaltInChannel(uint32_t instance, usb_core_phy_chep_t phy_ch_num);
usb_core_status_t USB_DRD_HaltOutChannel(uint32_t instance, usb_core_phy_chep_t phy_ch_num);
usb_core_status_t USB_DRD_HaltChannel(uint32_t instance, const usb_core_ch_t *p_ch);
usb_core_status_t USB_DRD_StartChannelXfer(uint32_t instance, usb_core_ch_t *p_ch);
usb_core_status_t USB_DRD_PMAReset(void);
usb_core_port_speed_t USB_DRD_GetHostPortSpeed(uint32_t instance);
usb_core_channel_t USB_DRD_GetLogicalChannel(usb_core_phy_chep_t phy_ch_num, usb_core_ch_direction_t ch_dir);
void     USB_DRD_ClearPhysicalChannels(void);
uint32_t USB_DRD_GetCurrentFrame(uint32_t instance);
uint32_t USB_DRD_GetDmaStatus(uint32_t instance);
/**
  * @}
  */

/**
  * @}
  */
#endif /* defined (USB_DRD_FS) */
/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */


#endif /* STM32U5xx_USB_DRD_CORE_H */
